Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ4010CA90208.atdf
        <register name="CHXSIZ" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="CHANNEL TRANSFER SIZE REGISTER">
          <bitfield name="CSZ" caption="Cell transfer size in bytes." mask="0x3FF"/>
          <bitfield name="BLKSZ" caption="Block transfer size in bytes." mask="0xFFFF0000"/>
        </register>
        <register name="CHPDAT" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="CHANNEL PATTERN MATCH DATA">
          <bitfield name="PDAT" caption="Channel Pattern Match Data" mask="0xFFFF"/>
          <bitfield name="PIGN" caption="Channel Pattern Ignore Value" mask="0xFF000000"/>
        </register>
        <register name="CHCTRLCRC" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="CHANNEL CONTROL CRC">
          <bitfield name="CRCMD" caption="CRC/Checksum Mode" mask="0x7" values="CHCTRLCRC__CRCMD"/>
          <bitfield name="CRCAPP" caption="CRC Append Mode" mask="0x8"/>
          <bitfield name="CRCXOR" caption="CRC XOR Mode" mask="0x20"/>
          <bitfield name="CRCROUT" caption="CRC Reflected Output Mode" mask="0x40"/>
          <bitfield name="CRCRIN" caption="CRC Reflect Input Selection" mask="0x80"/>
        </register>
        <register name="CHCRCDAT" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="CHANNEL CRC/CHECKSUM DATA REGISTER">
          <bitfield name="CRCDAT" caption="CRC Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="CHNXT" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="CHANNEL NEXT DESCRIPTOR ADDRESS POINTER">
          <bitfield name="NXT" caption="Channel Address Pointer to Next Descriptor" mask="0xFFFFFFFF"/>
        </register>
        <register name="CHLLCFGSTAT" offset="0x3C" rw="R" size="4" initval="0x00000000" caption="CHANNEL LINKED LIST CONFIGURATION STATUS REGISTER">
          <bitfield name="CTRLB" caption="CTRLB Register Descriptor Load" mask="0x1"/>
          <bitfield name="EVCTRL" caption="EVCTRL Register Descriptor Load" mask="0x2"/>
          <bitfield name="SSA" caption="Source Start Address Descriptor Load" mask="0x4"/>
          <bitfield name="DSA" caption="Destination Start Address Descriptor Load" mask="0x8"/>
          <bitfield name="SSTRD" caption="Source Cell Stride Size Descriptor Load" mask="0x10"/>
          <bitfield name="DSTRD" caption="Destination Cell Stride Size Descriptor Load" mask="0x20"/>
          <bitfield name="XSIZ" caption="Transfer Size Descriptor Load" mask="0x40"/>
          <bitfield name="PDAT" caption="Match Pattern Descriptor Load" mask="0x80"/>
          <bitfield name="CTRLCRC" caption="Control CRC Descriptor Load" mask="0x100"/>
          <bitfield name="CRCDAT" caption="CRC Data Descriptor Load" mask="0x200"/>
        </register>
        <register name="CHSTATBC" offset="0x40" rw="R" size="4" initval="0x00000000" caption="CHANNEL STATUS BLOCK COUNT REGISTER">
          <bitfield name="BBTC" caption="Bytes Transfered in the Block Counter" mask="0x1FFFF"/>
        </register>
        <register name="CHSTATCC" offset="0x44" rw="R" size="4" initval="0x00000000" caption="CHANNEL STATUS CELL COUNT REGISTER">
          <bitfield name="CBTC" caption="Bytes Transfered in the Cell Counter" mask="0x7FF"/>
        </register>
        <register name="CHSTAT" offset="0x48" rw="R" size="4" initval="0x00000000" caption="CHANNEL STATUS REGISTER">
          <bitfield name="BLKBUSY" caption="Channel Block Transfer Busy Status Bit (0: none; 1: busy)" mask="0x1"/>
          <bitfield name="CELLBUSY" caption="Channel Cell Transfer Busy Status Bit (0: none; 1: busy)" mask="0x2"/>
          <bitfield name="DREAD" caption="Descriptor Read Status Bit (0: not read or not avail, 1: read and loaded)" mask="0x4"/>
        </register>
      </register-group>
      <register-group name="DMA" caption="Direct Memory Access Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="DMA CONTROL A REGISTER">
          <bitfield name="ENABLE" caption="DMA Enable" mask="0x2"/>
        </register>
        <register name="DBGCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="DEBUG CONTROL REGISTER">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="CRCPOLYA" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="DMA CRC POLYNOMIAL A REGISTER">
          <bitfield name="POLYA" caption="CRC Polynomial Coefficients A Register" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCPOLYB" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="DMA CRC POLYNOMIAL B REGISTER">
          <bitfield name="POLYB" caption="CRC Polynomial Coefficients B Register" mask="0xFFFFFFFF"/>
        </register>
        <register name="INTSTAT4" offset="0x14" rw="R" size="4" initval="0x00000000" caption="DMA INTERRUPT PRIORITY 4 STATUS REGISTER">
          <bitfield name="CH0" caption="DMA Channel active interrupt at priority 4" mask="0x1"/>
          <bitfield name="CH1" caption="DMA Channel active interrupt at priority 4" mask="0x2"/>
          <bitfield name="CH2" caption="DMA Channel active interrupt at priority 4" mask="0x4"/>
          <bitfield name="CH3" caption="DMA Channel active interrupt at priority 4" mask="0x8"/>
          <bitfield name="CH4" caption="DMA Channel active interrupt at priority 4" mask="0x10"/>
          <bitfield name="CH5" caption="DMA Channel active interrupt at priority 4" mask="0x20"/>
          <bitfield name="CH6" caption="DMA Channel active interrupt at priority 4" mask="0x40"/>
          <bitfield name="CH7" caption="DMA Channel active interrupt at priority 4" mask="0x80"/>
          <bitfield name="CH8" caption="DMA Channel active interrupt at priority 4" mask="0x100"/>
          <bitfield name="CH9" caption="DMA Channel active interrupt at priority 4" mask="0x200"/>
          <bitfield name="CH10" caption="DMA Channel active interrupt at priority 4" mask="0x400"/>
          <bitfield name="CH11" caption="DMA Channel active interrupt at priority 4" mask="0x800"/>
          <bitfield name="CH12" caption="DMA Channel active interrupt at priority 4" mask="0x1000"/>
          <bitfield name="CH13" caption="DMA Channel active interrupt at priority 4" mask="0x2000"/>
          <bitfield name="CH14" caption="DMA Channel active interrupt at priority 4" mask="0x4000"/>
          <bitfield name="CH15" caption="DMA Channel active interrupt at priority 4" mask="0x8000"/>
          <bitfield name="CH16" caption="DMA Channel active interrupt at priority 4" mask="0x10000"/>
          <bitfield name="CH17" caption="DMA Channel active interrupt at priority 4" mask="0x20000"/>
          <bitfield name="CH18" caption="DMA Channel active interrupt at priority 4" mask="0x40000"/>
          <bitfield name="CH19" caption="DMA Channel active interrupt at priority 4" mask="0x80000"/>
          <bitfield name="CH20" caption="DMA Channel active interrupt at priority 4" mask="0x100000"/>
          <bitfield name="CH21" caption="DMA Channel active interrupt at priority 4" mask="0x200000"/>
          <bitfield name="CH22" caption="DMA Channel active interrupt at priority 4" mask="0x400000"/>
          <bitfield name="CH23" caption="DMA Channel active interrupt at priority 4" mask="0x800000"/>
        </register>
        <register name="INTSTAT3" offset="0x18" rw="R" size="4" initval="0x00000000" caption="DMA INTERRUPT PRIORITY 3 STATUS REGISTER">
          <bitfield name="CH0" caption="DMA Channel active interrupt at priority 3" mask="0x1"/>
          <bitfield name="CH1" caption="DMA Channel active interrupt at priority 3" mask="0x2"/>
          <bitfield name="CH2" caption="DMA Channel active interrupt at priority 3" mask="0x4"/>
          <bitfield name="CH3" caption="DMA Channel active interrupt at priority 3" mask="0x8"/>
          <bitfield name="CH4" caption="DMA Channel active interrupt at priority 3" mask="0x10"/>
          <bitfield name="CH5" caption="DMA Channel active interrupt at priority 3" mask="0x20"/>
          <bitfield name="CH6" caption="DMA Channel active interrupt at priority 3" mask="0x40"/>
          <bitfield name="CH7" caption="DMA Channel active interrupt at priority 3" mask="0x80"/>
          <bitfield name="CH8" caption="DMA Channel active interrupt at priority 3" mask="0x100"/>
          <bitfield name="CH9" caption="DMA Channel active interrupt at priority 3" mask="0x200"/>
          <bitfield name="CH10" caption="DMA Channel active interrupt at priority 3" mask="0x400"/>
          <bitfield name="CH11" caption="DMA Channel active interrupt at priority 3" mask="0x800"/>
          <bitfield name="CH12" caption="DMA Channel active interrupt at priority 3" mask="0x1000"/>
          <bitfield name="CH13" caption="DMA Channel active interrupt at priority 3" mask="0x2000"/>
          <bitfield name="CH14" caption="DMA Channel active interrupt at priority 3" mask="0x4000"/>
          <bitfield name="CH15" caption="DMA Channel active interrupt at priority 3" mask="0x8000"/>
          <bitfield name="CH16" caption="DMA Channel active interrupt at priority 3" mask="0x10000"/>
          <bitfield name="CH17" caption="DMA Channel active interrupt at priority 3" mask="0x20000"/>
          <bitfield name="CH18" caption="DMA Channel active interrupt at priority 3" mask="0x40000"/>
          <bitfield name="CH19" caption="DMA Channel active interrupt at priority 3" mask="0x80000"/>
          <bitfield name="CH20" caption="DMA Channel active interrupt at priority 3" mask="0x100000"/>
          <bitfield name="CH21" caption="DMA Channel active interrupt at priority 3" mask="0x200000"/>
          <bitfield name="CH22" caption="DMA Channel active interrupt at priority 3" mask="0x400000"/>
          <bitfield name="CH23" caption="DMA Channel active interrupt at priority 3" mask="0x800000"/>
        </register>
        <register name="INTSTAT2" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="DMA INTERRUPT PRIORITY 2 STATUS REGISTER">
          <bitfield name="CH0" caption="DMA Channel active interrupt at priority 2" mask="0x1"/>
          <bitfield name="CH1" caption="DMA Channel active interrupt at priority 2" mask="0x2"/>
          <bitfield name="CH2" caption="DMA Channel active interrupt at priority 2" mask="0x4"/>
          <bitfield name="CH3" caption="DMA Channel active interrupt at priority 2" mask="0x8"/>
          <bitfield name="CH4" caption="DMA Channel active interrupt at priority 2" mask="0x10"/>
          <bitfield name="CH5" caption="DMA Channel active interrupt at priority 2" mask="0x20"/>
          <bitfield name="CH6" caption="DMA Channel active interrupt at priority 2" mask="0x40"/>
          <bitfield name="CH7" caption="DMA Channel active interrupt at priority 2" mask="0x80"/>
          <bitfield name="CH8" caption="DMA Channel active interrupt at priority 2" mask="0x100"/>
          <bitfield name="CH9" caption="DMA Channel active interrupt at priority 2" mask="0x200"/>
          <bitfield name="CH10" caption="DMA Channel active interrupt at priority 2" mask="0x400"/>
          <bitfield name="CH11" caption="DMA Channel active interrupt at priority 2" mask="0x800"/>
          <bitfield name="CH12" caption="DMA Channel active interrupt at priority 2" mask="0x1000"/>
          <bitfield name="CH13" caption="DMA Channel active interrupt at priority 2" mask="0x2000"/>
          <bitfield name="CH14" caption="DMA Channel active interrupt at priority 2" mask="0x4000"/>
          <bitfield name="CH15" caption="DMA Channel active interrupt at priority 2" mask="0x8000"/>
          <bitfield name="CH16" caption="DMA Channel active interrupt at priority 2" mask="0x10000"/>
          <bitfield name="CH17" caption="DMA Channel active interrupt at priority 2" mask="0x20000"/>
          <bitfield name="CH18" caption="DMA Channel active interrupt at priority 2" mask="0x40000"/>
          <bitfield name="CH19" caption="DMA Channel active interrupt at priority 2" mask="0x80000"/>
          <bitfield name="CH20" caption="DMA Channel active interrupt at priority 2" mask="0x100000"/>
          <bitfield name="CH21" caption="DMA Channel active interrupt at priority 2" mask="0x200000"/>
          <bitfield name="CH22" caption="DMA Channel active interrupt at priority 2" mask="0x400000"/>
          <bitfield name="CH23" caption="DMA Channel active interrupt at priority 2" mask="0x800000"/>
        </register>
        <register name="INTSTAT1" offset="0x20" rw="R" size="4" initval="0x00000000" caption="DMA INTERRUPT PRIORITY 1 STATUS REGISTER">
          <bitfield name="CH0" caption="DMA Channel active interrupt at priority 1" mask="0x1"/>
          <bitfield name="CH1" caption="DMA Channel active interrupt at priority 1" mask="0x2"/>
          <bitfield name="CH2" caption="DMA Channel active interrupt at priority 1" mask="0x4"/>
          <bitfield name="CH3" caption="DMA Channel active interrupt at priority 1" mask="0x8"/>
          <bitfield name="CH4" caption="DMA Channel active interrupt at priority 1" mask="0x10"/>
          <bitfield name="CH5" caption="DMA Channel active interrupt at priority 1" mask="0x20"/>
          <bitfield name="CH6" caption="DMA Channel active interrupt at priority 1" mask="0x40"/>
          <bitfield name="CH7" caption="DMA Channel active interrupt at priority 1" mask="0x80"/>
          <bitfield name="CH8" caption="DMA Channel active interrupt at priority 1" mask="0x100"/>
          <bitfield name="CH9" caption="DMA Channel active interrupt at priority 1" mask="0x200"/>
          <bitfield name="CH10" caption="DMA Channel active interrupt at priority 1" mask="0x400"/>
          <bitfield name="CH11" caption="DMA Channel active interrupt at priority 1" mask="0x800"/>
          <bitfield name="CH12" caption="DMA Channel active interrupt at priority 1" mask="0x1000"/>
          <bitfield name="CH13" caption="DMA Channel active interrupt at priority 1" mask="0x2000"/>
          <bitfield name="CH14" caption="DMA Channel active interrupt at priority 1" mask="0x4000"/>
          <bitfield name="CH15" caption="DMA Channel active interrupt at priority 1" mask="0x8000"/>
          <bitfield name="CH16" caption="DMA Channel active interrupt at priority 1" mask="0x10000"/>
          <bitfield name="CH17" caption="DMA Channel active interrupt at priority 1" mask="0x20000"/>
          <bitfield name="CH18" caption="DMA Channel active interrupt at priority 1" mask="0x40000"/>
          <bitfield name="CH19" caption="DMA Channel active interrupt at priority 1" mask="0x80000"/>
          <bitfield name="CH20" caption="DMA Channel active interrupt at priority 1" mask="0x100000"/>
          <bitfield name="CH21" caption="DMA Channel active interrupt at priority 1" mask="0x200000"/>
          <bitfield name="CH22" caption="DMA Channel active interrupt at priority 1" mask="0x400000"/>
          <bitfield name="CH23" caption="DMA Channel active interrupt at priority 1" mask="0x800000"/>
        </register>
