Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ4010CA90208.atdf
        <register name="MEMTYPE" offset="0x1FCC" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Memory Type">
          <bitfield name="SMEMP" caption="System Memory Present" mask="0x1"/>
        </register>
        <register name="PID4" offset="0x1FD0" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 4">
          <bitfield name="JEPCC" caption="JEP-106 Continuation Code" mask="0xF"/>
          <bitfield name="FKBC" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="PID5" offset="0x1FD4" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 5">
        </register>
        <register name="PID6" offset="0x1FD8" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 6">
        </register>
        <register name="PID7" offset="0x1FDC" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 7">
        </register>
        <register name="PID0" offset="0x1FE0" rw="R" size="4" initval="0x000000D0" caption="Coresight ROM Table Peripheral Identification 0">
          <bitfield name="PARTNBL" caption="Part Number Low" mask="0xFF"/>
        </register>
        <register name="PID1" offset="0x1FE4" rw="R" size="4" initval="0x0000009C" caption="Coresight ROM Table Peripheral Identification 1">
          <bitfield name="PARTNBH" caption="Part Number High" mask="0xF"/>
          <bitfield name="JEPIDCL" caption="Low part of the JEP-106 Identity Code" mask="0xF0"/>
        </register>
        <register name="PID2" offset="0x1FE8" rw="R" size="4" initval="0x0000002A" caption="Coresight ROM Table Peripheral Identification 2">
          <bitfield name="JEPIDCH" caption="JEP-106 Identity Code High" mask="0x7"/>
          <bitfield name="JEPU" caption="JEP-106 Identity Code is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="PID3" offset="0x1FEC" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 3">
          <bitfield name="CUSMOD" caption="ARM CUSMOD" mask="0xF"/>
          <bitfield name="REVAND" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="CID0" offset="0x1FF0" rw="R" size="4" initval="0x0000000D" caption="Coresight ROM Table Component Identification 0">
          <bitfield name="PREAMBLEB0" caption="Preamble Byte 0" mask="0xFF"/>
        </register>
        <register name="CID1" offset="0x1FF4" rw="R" size="4" initval="0x00000010" caption="Coresight ROM Table Component Identification 1">
          <bitfield name="PREAMBLE" caption="Preamble" mask="0xF"/>
          <bitfield name="CCLASS" caption="Component Class" mask="0xF0"/>
        </register>
        <register name="CID2" offset="0x1FF8" rw="R" size="4" initval="0x00000005" caption="Coresight ROM Table Component Identification 2">
          <bitfield name="PREAMBLEB2" caption="Preamble Byte 2" mask="0xFF"/>
        </register>
        <register name="CID3" offset="0x1FFC" rw="R" size="4" initval="0x000000B1" caption="Coresight ROM Table Component Identification 3">
          <bitfield name="PREAMBLEB3" caption="Preamble Byte 3" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="CTRL__CMD">
        <value name="NOOP" caption="No operation" value="0x0"/>
        <value name="CRC32" caption="32-bit Cyclic Redundancy Code" value="0xA500"/>
        <value name="MBIST" caption="Global Memory built-in self-test" value="0xA501"/>
      </value-group>
      <value-group name="ADDR__AMOD">
        <value name="EXIT_ON_ERROR" caption="STATUSA.FAIL rises upon first error and algorithm stops (STATUSA.DONE rises)." value="0x0"/>
        <value name="PAUSE_ON_ERROR" caption="STATUSA.FAIL rises when an error is detected and algorith stops until STATUSA.FAIL is cleared. Once cleared, the algorithm is resumed going to next test step." value="0x1"/>
      </value-group>
      <value-group name="DATA__STATE">
        <value name="SET1" caption="SET1 Phase: read '0' write '1'" value="0x9"/>
        <value name="SET2" caption="SET2 Phase: read '1' write '0'" value="0xA"/>
        <value name="SET2B" caption="SET2B Phase: read '0' write '1'" value="0xB"/>
        <value name="CLEAR1" caption="CLEAR1 Phase: read '1' write '0'" value="0xC"/>
        <value name="CLEAR2" caption="CLEAR2 Phase: read '0' write '1'" value="0xD"/>
        <value name="CLEAR2B" caption="CLEAR2B Phase: read '1' write '0'" value="0xE"/>
        <value name="READ" caption="READ Phase: check memory is cleared" value="0xF"/>
      </value-group>
      <value-group name="CFG__DCCDMALEVEL">
        <value name="EMPTY" caption="Trigger x rises when DCC is read and falls when it is written" value="0"/>
        <value name="FULL" caption="Trigger x rises when DCC is written and falls when it is read" value="1"/>
      </value-group>
      <value-group name="MBFI0__AMMOD">
        <value name="ADDR" caption="Address match, fault injected when the masked master address matches with the masked bcc1.addr" value="0x0"/>
        <value name="ALWAYS" caption="Always matches, fault injected every AHB access" value="0x1"/>
      </value-group>
      <value-group name="MBFI0__FTYPE">
        <value name="STUCKAT0" caption="Stuck At 0" value="0x0"/>
        <value name="STUCKAT1" caption="Stuck At 1" value="0x1"/>
      </value-group>
      <value-group name="STATUSC__STATE">
        <value name="IDLE" caption="State Machine Ready" value="0x0"/>
        <value name="MBIST_FILL" caption="MBIST fill memory with zeroes" value="0x8"/>
        <value name="MBIST_SET1" caption="SET1 Phase: read '0' write '1'" value="0x9"/>
        <value name="MBIST_SET2" caption="SET2 Phase: read '1' write '0'" value="0xA"/>
        <value name="MBIST_SET2B" caption="SET2B Phase: read '0' write '1'" value="0xB"/>
        <value name="MBIST_CLEAR1" caption="CLEAR1 Phase: read '1' write '0'" value="0xC"/>
        <value name="MBIST_CLEAR2" caption="CLEAR2 Phase: read '0' write '1'" value="0xD"/>
        <value name="MBIST_CLEAR2B" caption="CLEAR2B Phase: read '1' write '0'" value="0xE"/>
        <value name="MBIST_READ" caption="READ Phase: check memory is cleared" value="0xF"/>
      </value-group>
      <value-group name="DAL__CPU">
        <value name="SECURED" caption="Debugger targeting CPU0 domain can only access the DSU external address space otherwise debugger access is disabled" value="0x0"/>
        <value name="NS_DEBUG" caption="Debugger can access only non-secure regions" value="0x1"/>
        <value name="FULL_DEBUG" caption="Debugger can access secure and non-secure regions" value="0x2"/>
        <value name="UNIMPLEMENTED" caption="No CPU in this slot" value="0x3"/>
      </value-group>
    </module>
    <module name="DWT" id="SYSTEM_IP" version="1.0.0" caption="Data Watchpoint and Trace Register">
      <register-group name="DWT" caption="Data Watchpoint and Trace Register">
        <register name="CTRL" offset="0x0" rw="RW" size="4" access-size="4" caption="Control Register">
          <bitfield name="CYCCNTENA" caption="" mask="0x1"/>
          <bitfield name="POSTPRESET" caption="" mask="0x1E"/>
          <bitfield name="POSTINIT" caption="" mask="0x1E0"/>
          <bitfield name="CYCTAP" caption="" mask="0x200"/>
          <bitfield name="SYNCTAP" caption="" mask="0xC00"/>
          <bitfield name="PCSAMPLENA" caption="" mask="0x1000"/>
          <bitfield name="EXCTRCENA" caption="" mask="0x10000"/>
          <bitfield name="CPIEVTENA" caption="" mask="0x20000"/>
          <bitfield name="EXCEVTENA" caption="" mask="0x40000"/>
          <bitfield name="SLEEPEVTENA" caption="" mask="0x80000"/>
          <bitfield name="LSUEVTENA" caption="" mask="0x100000"/>
          <bitfield name="FOLDEVTENA" caption="" mask="0x200000"/>
          <bitfield name="CYCEVTENA" caption="" mask="0x400000"/>
          <bitfield name="NOPRFCNT" caption="" mask="0x1000000"/>
          <bitfield name="NOCYCCNT" caption="" mask="0x2000000"/>
          <bitfield name="NOEXTTRIG" caption="" mask="0x4000000"/>
          <bitfield name="NOTRCPKT" caption="" mask="0x8000000"/>
          <bitfield name="NUMCOMP" caption="" mask="0xF0000000"/>
        </register>
        <register name="CYCCNT" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Cycle Count Register">
        </register>
        <register name="CPICNT" offset="0x8" rw="RW" size="4" access-size="4" caption="CPI Count Register">
          <bitfield name="CPICNT" caption="" mask="0xFF"/>
        </register>
        <register name="EXCCNT" offset="0xC" rw="RW" size="4" access-size="4" caption="Exception Overhead Count Register">
          <bitfield name="EXCCNT" caption="" mask="0xFF"/>
        </register>
        <register name="SLEEPCNT" offset="0x10" rw="RW" size="4" access-size="4" caption="Sleep Count Register">
          <bitfield name="SLEEPCNT" caption="" mask="0xFF"/>
        </register>
        <register name="LSUCNT" offset="0x14" rw="RW" size="4" access-size="4" caption="LSU Count Register">
          <bitfield name="LSUCNT" caption="" mask="0xFF"/>
        </register>
        <register name="FOLDCNT" offset="0x18" rw="RW" size="4" access-size="4" caption="Folded-instruction Count Register">
          <bitfield name="FOLDCNT" caption="" mask="0xFF"/>
        </register>
        <register name="PCSR" offset="0x1C" rw="R" size="4" access-size="4" caption="Program Counter Sample Register">
        </register>
        <register name="COMP0" offset="0x20" rw="RW" size="4" access-size="4" caption="Comparator Register 0">
        </register>
        <register name="MASK0" offset="0x24" rw="RW" size="4" access-size="4" caption="Mask Register 0">
          <bitfield name="MASK" caption="" mask="0x1F"/>
        </register>
        <register name="FUNCTION0" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Function Register 0">
          <bitfield name="FUNCTION" caption="" mask="0xF"/>
          <bitfield name="EMITRANGE" caption="" mask="0x20"/>
          <bitfield name="CYCMATCH" caption="" mask="0x80"/>
          <bitfield name="DATAVMATCH" caption="" mask="0x100"/>
          <bitfield name="LNK1ENA" caption="" mask="0x200"/>
          <bitfield name="DATAVSIZE" caption="" mask="0xC00"/>
          <bitfield name="DATAVADDR0" caption="" mask="0xF000"/>
          <bitfield name="DATAVADDR1" caption="" mask="0xF0000"/>
          <bitfield name="MATCHED" caption="" mask="0x1000000"/>
        </register>
        <register name="COMP1" offset="0x30" rw="RW" size="4" access-size="4" caption="Comparator Register 1">
        </register>
        <register name="MASK1" offset="0x34" rw="RW" size="4" access-size="4" caption="Mask Register 1">
          <bitfield name="MASK" caption="" mask="0x1F"/>
        </register>
