Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ4010CA90208.atdf
        <register name="MAN" offset="0x1034" rw="RW" size="4" initval="0x00000000" caption="PHY Maintenance Register">
          <bitfield name="DATA" caption="PHY Data" mask="0xFFFF"/>
          <bitfield name="WTN" caption="Write Ten" mask="0x30000"/>
          <bitfield name="REGA" caption="Register Address" mask="0x7C0000"/>
          <bitfield name="PHYA" caption="PHY Address" mask="0xF800000"/>
          <bitfield name="OP" caption="Operation" mask="0x30000000"/>
          <bitfield name="CLTTO" caption="Clause 22 Operation" mask="0x40000000"/>
          <bitfield name="WZO" caption="Write ZERO" mask="0x80000000"/>
        </register>
        <register name="RPQ" offset="0x1038" rw="R" size="4" initval="0x00000000" caption="Received Pause Quantum Register">
          <bitfield name="RPQ" caption="Received Pause Quantum" mask="0xFFFF"/>
        </register>
        <register name="TPQ" offset="0x103C" rw="RW" size="4" initval="0x0000FFFF" caption="Transmit Pause Quantum Register">
          <bitfield name="TPQ" caption="Transmit Pause Quantum" mask="0xFFFF"/>
        </register>
        <register name="TPSF" offset="0x1040" rw="RW" size="4" initval="0x000003FF" caption="TX partial store and forward Register">
          <bitfield name="TPB1ADR" caption="TX packet buffer address" mask="0x3FF"/>
          <bitfield name="ENTXP" caption="Enable TX partial store and forward operation" mask="0x80000000"/>
        </register>
        <register name="RPSF" offset="0x1044" rw="RW" size="4" initval="0x000003FF" caption="RX partial store and forward Register">
          <bitfield name="RPB1ADR" caption="RX packet buffer address" mask="0x3FF"/>
          <bitfield name="ENRXP" caption="Enable RX partial store and forward operation" mask="0x80000000"/>
        </register>
        <register name="RJFML" offset="0x1048" rw="RW" size="4" initval="0x00002800" caption="RX Jumbo Frame Max Length Register">
          <bitfield name="FML" caption="Frame Max Length" mask="0x3FFF"/>
        </register>
        <register name="HRB" offset="0x1080" rw="RW" size="4" initval="0x00000000" caption="Hash Register Bottom [31:0]">
          <bitfield name="ADDR" caption="Hash Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="HRT" offset="0x1084" rw="RW" size="4" initval="0x00000000" caption="Hash Register Top [63:32]">
          <bitfield name="ADDR" caption="Hash Address" mask="0xFFFFFFFF"/>
        </register>
        <register-group name="SA" name-in-module="SA" offset="0x1088" size="0x8" count="4"/>
        <register name="TIDM" offset="0x10A8" rw="RW" size="4" count="4" initval="0x00000000" caption="Type ID Match Register">
          <bitfield name="TID" caption="Type ID Match 1" mask="0xFFFF"/>
        </register>
        <register name="WOL" offset="0x10B8" rw="RW" size="4" initval="0x00000000" caption="Wake on LAN">
          <bitfield name="IP" caption="IP address" mask="0xFFFF"/>
          <bitfield name="MAG" caption="Event enable" mask="0x10000"/>
          <bitfield name="ARP" caption="LAN ARP req" mask="0x20000"/>
          <bitfield name="SA1" caption="WOL specific address reg 1" mask="0x40000"/>
          <bitfield name="MTI" caption="WOL LAN multicast" mask="0x80000"/>
        </register>
        <register name="IPGS" offset="0x10BC" rw="RW" size="4" initval="0x00000000" caption="IPG Stretch Register">
          <bitfield name="FL" caption="Frame Length" mask="0xFFFF"/>
        </register>
        <register name="SVLAN" offset="0x10C0" rw="RW" size="4" initval="0x00000000" caption="Stacked VLAN Register">
          <bitfield name="VLAN_TYPE" caption="User Defined VLAN_TYPE Field" mask="0xFFFF"/>
          <bitfield name="ESVLAN" caption="Enable Stacked VLAN Processing Mode" mask="0x80000000"/>
        </register>
        <register name="TPFCP" offset="0x10C4" rw="RW" size="4" initval="0x00000000" caption="Transmit PFC Pause Register">
          <bitfield name="PEV" caption="Priority Enable Vector" mask="0xFF"/>
          <bitfield name="PQ" caption="Pause Quantum" mask="0xFF00"/>
        </register>
        <register name="SAMB1" offset="0x10C8" rw="RW" size="4" initval="0x00000000" caption="Specific Address 1 Mask Bottom [31:0] Register">
          <bitfield name="ADDR" caption="Specific Address 1 Mask" mask="0xFFFFFFFF"/>
        </register>
        <register name="SAMT1" offset="0x10CC" rw="RW" size="4" initval="0x00000000" caption="Specific Address 1 Mask Top [47:32] Register">
          <bitfield name="ADDR" caption="Specific Address 1 Mask" mask="0xFFFF"/>
        </register>
        <register name="NSC" offset="0x10DC" rw="RW" size="4" initval="0x00000000" caption="Tsu timer comparison nanoseconds Register">
          <bitfield name="NANOSEC" caption="1588 Timer Nanosecond comparison value" mask="0x1FFFFF"/>
        </register>
        <register name="SCL" offset="0x10E0" rw="RW" size="4" initval="0x00000000" caption="Tsu timer second comparison Register">
          <bitfield name="SEC" caption="1588 Timer Second comparison value" mask="0xFFFFFFFF"/>
        </register>
        <register name="SCH" offset="0x10E4" rw="RW" size="4" initval="0x00000000" caption="Tsu timer second comparison Register">
          <bitfield name="SEC" caption="1588 Timer Second comparison value" mask="0xFFFF"/>
        </register>
        <register name="EFTSH" offset="0x10E8" rw="R" size="4" initval="0x00000000" caption="PTP Event Frame Transmitted Seconds High Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFF"/>
        </register>
        <register name="EFRSH" offset="0x10EC" rw="R" size="4" initval="0x00000000" caption="PTP Event Frame Received Seconds High Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFF"/>
        </register>
        <register name="PEFTSH" offset="0x10F0" rw="R" size="4" initval="0x00000000" caption="PTP Peer Event Frame Transmitted Seconds High Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFF"/>
        </register>
        <register name="PEFRSH" offset="0x10F4" rw="R" size="4" initval="0x00000000" caption="PTP Peer Event Frame Received Seconds High Register">
          <bitfield name="RUD" caption="Register Update" mask="0xFFFF"/>
        </register>
        <register name="OTLO" offset="0x1100" rw="R" size="4" initval="0x00000000" caption="Octets Transmitted [31:0] Register">
          <bitfield name="TXO" caption="Transmitted Octets" mask="0xFFFFFFFF"/>
        </register>
        <register name="OTHI" offset="0x1104" rw="R" size="4" initval="0x00000000" caption="Octets Transmitted [47:32] Register">
          <bitfield name="TXO" caption="Transmitted Octets" mask="0xFFFF"/>
        </register>
        <register name="FT" offset="0x1108" rw="R" size="4" initval="0x00000000" caption="Frames Transmitted Register">
          <bitfield name="FTX" caption="Frames Transmitted without Error" mask="0xFFFFFFFF"/>
        </register>
