Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ4010CA90208.atdf
      <value-group name="CTRLA__SWRST">
        <value name="LOW" caption="No reset in progress" value="0x0"/>
        <value name="HIGH" caption="Reseting the registers and EIP" value="0x1"/>
      </value-group>
      <value-group name="CTRLA__RUNSTDBY">
        <value name="LOW" caption="Module is disabled in Standby Sleep mode" value="0x0"/>
        <value name="HIGH" caption="Module continues to run in Standby Sleep mode" value="0x1"/>
      </value-group>
      <value-group name="INTENCLR__SQI">
        <value name="LOW" caption="Interrupt Enabled" value="0x0"/>
        <value name="HIGH" caption="Interrupt Disabled" value="0x1"/>
      </value-group>
      <value-group name="INTENSET__SQI">
        <value name="LOW" caption="Interrupt disabled" value="0x0"/>
        <value name="HIGH" caption="Interrupt enabled" value="0x1"/>
      </value-group>
      <value-group name="SYNCBUSY__SWRST">
        <value name="LOW" caption="SWRST synchronization is not busy" value="0x0"/>
        <value name="HIGH" caption="SWRST synchronization is busy" value="0x1"/>
      </value-group>
    </module>
    <module name="SUPC" id="03926" name2="pwr_rpmu_supc_v1" version="1a0" caption="Supply Controller">
      <register-group name="SUPC" caption="Supply Controller">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="LVDET" caption="Low Voltage Detector Interrupt Enable" mask="0x1"/>
          <bitfield name="LVDRDY" caption="Low Voltage Detector Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="BORVDDUSB" caption="BORVDDUSB Interrupt Enable" mask="0x60"/>
          <bitfield name="ADDVREGRDY0" caption="Additional Regulator ready 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="ADDVREGRDY1" caption="Additional Regulator ready 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="ADDVREGRDY2" caption="Additional Regulator ready 2 Interrupt Enable" mask="0x400"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="LVDET" caption="Low Voltage Detector Interrupt Enable" mask="0x1"/>
          <bitfield name="LVDRDY" caption="Low Voltage Detector Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="BORVDDUSB" caption="BORVDDUSB Interrupt Enable" mask="0x60"/>
          <bitfield name="ADDVREGRDY0" caption="Additional Regulator ready 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="ADDVREGRDY1" caption="Additional Regulator ready 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="ADDVREGRDY2" caption="Additional Regulator ready 2 Interrupt Enable" mask="0x400"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="LVDET" caption="Low Voltage Detector Interrupt. Set to one if VDDIO crosses the treshold voltage in the good direction according to LVD.DIR." mask="0x1"/>
          <bitfield name="LVDRDY" caption="Low Voltage Detector Ready Interrupt. Set to one if LVD is ready to operate." mask="0x2"/>
          <bitfield name="BORVDDUSB" caption="BORVDDUSB Interrupt. Set to one if VDDUSB issue is detected." mask="0x60"/>
          <bitfield name="ADDVREGRDY0" caption="Additional Regulator ready 0 Interrupt. Set to one if additionnal regulator is ready meaning that output voltage is correct." mask="0x100"/>
          <bitfield name="ADDVREGRDY1" caption="Additional Regulator ready 1 Interrupt. Set to one if additionnal regulator is ready meaning that output voltage is correct." mask="0x200"/>
          <bitfield name="ADDVREGRDY2" caption="Additional Regulator ready 2 Interrupt. Set to one if additionnal regulator is ready meaning that output voltage is correct." mask="0x400"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Flag status">
          <bitfield name="LVDET" caption="Low Voltage Detector Status." mask="0x1"/>
          <bitfield name="LVDRDY" caption="Low Voltage Detector Ready Status" mask="0x2"/>
          <bitfield name="BORVDDUSB" caption="BORVDDUSB Status. One if VDDUSB is OK. It corresponds to bor_vddusb_n_mv signal of SMOR." mask="0x60"/>
          <bitfield name="ADDVREGRDY0" caption="Additional Regulator ready 0 Status. One if voltage is OK. It corresponds to vreg_ready_mv signal of additional regulator." mask="0x100"/>
          <bitfield name="ADDVREGRDY1" caption="Additional Regulator ready 1 Status. One if voltage is OK. It corresponds to vreg_ready_mv signal of additional regulator." mask="0x200"/>
          <bitfield name="ADDVREGRDY2" caption="Additional Regulator ready 2 Status. One if voltage is OK. It corresponds to vreg_ready_mv signal of additional regulator." mask="0x400"/>
        </register>
        <register name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Synchronisation Busy">
          <bitfield name="BOR" caption="BOR Synchronization Busy" mask="0x1"/>
        </register>
        <register name="BOR" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="BOR Control">
          <bitfield name="DCBORPSEL" caption="Duty Cycle BOR Prescaler Select" mask="0x70" values="BOR__DCBORPSEL"/>
          <bitfield name="BORFILT" caption="BOR filtering" mask="0x300" values="BOR__BORFILT"/>
        </register>
        <register name="LVD" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="LVD Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="DIR" caption="Direction" mask="0x4" values="LVD__DIR"/>
          <bitfield name="OEVEN" caption="Output Event Enable" mask="0x8"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x10"/>
          <bitfield name="LEVEL" caption="Threshold Level. See &quot;pwr_smor_[nn]_v1 DOS&quot; - level section to get details." mask="0xF0000"/>
        </register>
        <register name="VREGCTRL" offset="0x1C" rw="RW" size="4" initval="0x00000030" caption="VREG Control">
          <bitfield name="VREGOUT" caption="VREG Output Control in RUN mode only. Enable by production fuse by CALSUPC.VREGOUTEN" mask="0x3" values="VREGCTRL__VREGOUT"/>
          <bitfield name="OFFSTDBY" caption="Off in Standby Control for VREGSW[N-1]. Useful for Riverside only." mask="0x4" values="VREGCTRL__OFFSTDBY"/>
          <bitfield name="SRAM_VLD" caption="SRAM Valid Status Bit" mask="0x10" values="VREGCTRL__SRAM_VLD"/>
          <bitfield name="BKUP_VLD" caption="Backup Valid Status Bit" mask="0x20" values="VREGCTRL__BKUP_VLD"/>
          <bitfield name="CPEN" caption="Charge Pump Enable and Auto-enable." mask="0x700"/>
          <bitfield name="AVREGEN" caption="Additional Voltage Regulator Enable" mask="0x70000"/>
          <bitfield name="AVREGSTDBY" caption="Additional Voltage Regulator Configuration" mask="0x7000000" values="VREGCTRL__AVREGSTDBY"/>
        </register>
        <register name="VREFCTRL" offset="0x20" rw="RW" size="4" initval="0x00000003" caption="VREF Control">
          <bitfield name="LPSTDBY" caption="Bandgap and Regulators Low Power Standby Enable" mask="0x1" values="VREFCTRL__LPSTDBY"/>
          <bitfield name="LPHIB" caption="Bandgap and Regulators Low Power Hibernate Enable" mask="0x2" values="VREFCTRL__LPHIB"/>
          <bitfield name="TSEN" caption="Temperature Sensor Output Enable" mask="0x10"/>
        </register>
        <register name="BKOUT" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="Backup Output Control">
          <bitfield name="EN0" caption="Enable Output" mask="0x1"/>
          <bitfield name="EN1" caption="Enable Output" mask="0x4"/>
          <bitfield name="CLR0" caption="Clear Output" mask="0x100"/>
          <bitfield name="CLR1" caption="Clear Output" mask="0x400"/>
          <bitfield name="SET0" caption="Set Output" mask="0x10000"/>
          <bitfield name="SET1" caption="Set Output" mask="0x40000"/>
          <bitfield name="TGLOM0" caption="Toggle Output Mode" mask="0x3000000" values="BKOUT__TGLOM"/>
          <bitfield name="TGLOM1" caption="Toggle Output Mode" mask="0xC000000" values="BKOUT__TGLOM"/>
        </register>
